In [8]:

%load_ext sql

%sql ibm_db_sa://zll40028:Mg4WBcDrciMAxZq3@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB?security=SSL

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
import pandas

In [11]:
%%sql
select TABSCHEMA, TABNAME, CREATE_TIME from SYSCAT.TABLES where TABSCHEMA='zll40028'

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[]

In [13]:
# запрошу все таблицы без учета системных под своим логином (то етсь мои)
%%sql
select TABSCHEMA, TABNAME, CREATE_TIME from SYSCAT.TABLES 
      where TABSCHEMA not in ('SYSIBM', 'SYSCAT', 'SYSSTAT', 'SYSIBMADM', 'SYSTOOLS', 'SYSPUBLIC');

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[('ZLL40028', 'SCHOOLS', datetime.datetime(2023, 1, 24, 16, 19, 38, 308336)),
 ('ZLL40028', 'CHICAGO_SOCIOECONOMIC_DATA', datetime.datetime(2023, 1, 24, 16, 27, 31, 600308)),
 ('ZLL40028', 'CRIMEDATA', datetime.datetime(2023, 1, 25, 10, 10, 32, 721730)),
 ('ZLL40028', 'EMPLOYEES', datetime.datetime(2023, 1, 19, 21, 9, 53, 844246)),
 ('ZLL40028', 'JOB_HISTORY', datetime.datetime(2023, 1, 19, 21, 9, 53, 970504)),
 ('ZLL40028', 'JOBS', datetime.datetime(2023, 1, 19, 21, 9, 54, 102083)),
 ('ZLL40028', 'DEPARTMENTS', datetime.datetime(2023, 1, 19, 21, 9, 54, 217915)),
 ('ZLL40028', 'LOCATIONS', datetime.datetime(2023, 1, 19, 21, 9, 54, 334584)),
 ('ZLL40028', 'PETRESCUE', datetime.datetime(2023, 1, 20, 13, 28, 22, 440974)),
 ('ZLL40028', 'INSTRUCTOR', datetime.datetime(2023, 1, 22, 18, 28, 42, 874769)),
 ('ZLL40028', 'INTERNATIONAL_STUDENT_TEST_SCORES', datetime.datetime(2023, 1, 23, 15, 46, 47, 839621)),
 ('ZLL40028', 'PETSALE', datetime.datetime(2023, 1, 18, 19, 41, 29, 93510))]

In [17]:
%%sql
select count(*) as count_rows from SYSCAT.COLUMNS 
where TABNAME = 'SCHOOLS';

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(78,)]

In [19]:
%%sql
select COLNAME, TYPENAME, LENGTH from SYSCAT.COLUMNS where TABNAME = 'SCHOOLS';

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[('SCHOOL_ID', 'INTEGER', 4),
 ('NAME_OF_SCHOOL', 'VARCHAR', 64),
 ('Elementary, Middle, or High School', 'VARCHAR', 2),
 ('STREET_ADDRESS', 'VARCHAR', 29),
 ('CITY', 'VARCHAR', 7),
 ('STATE', 'VARCHAR', 2),
 ('ZIP_CODE', 'INTEGER', 4),
 ('PHONE_NUMBER', 'VARCHAR', 14),
 ('LINK', 'VARCHAR', 78),
 ('NETWORK_MANAGER', 'VARCHAR', 40),
 ('COLLABORATIVE_NAME', 'VARCHAR', 34),
 ('ADEQUATE_YEARLY_PROGRESS_MADE_', 'VARCHAR', 3),
 ('TRACK_SCHEDULE', 'VARCHAR', 12),
 ('CPS_PERFORMANCE_POLICY_STATUS', 'VARCHAR', 16),
 ('CPS_PERFORMANCE_POLICY_LEVEL', 'VARCHAR', 15),
 ('HEALTHY_SCHOOL_CERTIFIED', 'VARCHAR', 3),
 ('SAFETY_ICON', 'VARCHAR', 11),
 ('SAFETY_SCORE', 'SMALLINT', 2),
 ('FAMILY_INVOLVEMENT_ICON', 'VARCHAR', 11),
 ('FAMILY_INVOLVEMENT_SCORE', 'VARCHAR', 3),
 ('ENVIRONMENT_ICON', 'VARCHAR', 11),
 ('ENVIRONMENT_SCORE', 'SMALLINT', 2),
 ('INSTRUCTION_ICON', 'VARCHAR', 11),
 ('INSTRUCTION_SCORE', 'SMALLINT', 2),
 ('LEADERS_ICON', 'VARCHAR', 4),
 ('LEADERS_SCORE', 'VARCHAR', 3),
 ('TEACHERS_ICON', 'VARCHAR', 11),
 ('TEACHERS_SCORE', 'VARCHAR', 3),
 ('PARENT_ENGAGEMENT_ICON', 'VARCHAR', 7),
 ('PARENT_ENGAGEMENT_SCORE', 'VARCHAR', 3),
 ('PARENT_ENVIRONMENT_ICON', 'VARCHAR', 7),
 ('PARENT_ENVIRONMENT_SCORE', 'VARCHAR', 3),
 ('AVERAGE_STUDENT_ATTENDANCE', 'VARCHAR', 6),
 ('RATE_OF_MISCONDUCTS__PER_100_STUDENTS_', 'DECIMAL', 5),
 ('AVERAGE_TEACHER_ATTENDANCE', 'VARCHAR', 6),
 ('INDIVIDUALIZED_EDUCATION_PROGRAM_COMPLIANCE_RATE', 'VARCHAR', 7),
 ('PK_2_LITERACY__', 'VARCHAR', 4),
 ('PK_2_MATH__', 'VARCHAR', 4),
 ('GR3_5_GRADE_LEVEL_MATH__', 'VARCHAR', 4),
 ('GR3_5_GRADE_LEVEL_READ__', 'VARCHAR', 4),
 ('GR3_5_KEEP_PACE_READ__', 'VARCHAR', 4),
 ('GR3_5_KEEP_PACE_MATH__', 'VARCHAR', 4),
 ('GR6_8_GRADE_LEVEL_MATH__', 'VARCHAR', 4),
 ('GR6_8_GRADE_LEVEL_READ__', 'VARCHAR', 4),
 ('GR6_8_KEEP_PACE_MATH_', 'VARCHAR', 4),
 ('GR6_8_KEEP_PACE_READ__', 'VARCHAR', 4),
 ('GR_8_EXPLORE_MATH__', 'VARCHAR', 4),
 ('GR_8_EXPLORE_READ__', 'VARCHAR', 4),
 ('ISAT_EXCEEDING_MATH__', 'DECIMAL', 4),
 ('ISAT_EXCEEDING_READING__', 'DECIMAL', 4),
 ('ISAT_VALUE_ADD_MATH', 'DECIMAL', 3),
 ('ISAT_VALUE_ADD_READ', 'DECIMAL', 3),
 ('ISAT_VALUE_ADD_COLOR_MATH', 'VARCHAR', 6),
 ('ISAT_VALUE_ADD_COLOR_READ', 'VARCHAR', 6),
 ('STUDENTS_TAKING__ALGEBRA__', 'VARCHAR', 4),
 ('STUDENTS_PASSING__ALGEBRA__', 'VARCHAR', 4),
 ('9th Grade EXPLORE (2009)', 'VARCHAR', 4),
 ('9th Grade EXPLORE (2010)', 'VARCHAR', 4),
 ('10th Grade PLAN (2009)', 'VARCHAR', 4),
 ('10th Grade PLAN (2010)', 'VARCHAR', 4),
 ('NET_CHANGE_EXPLORE_AND_PLAN', 'VARCHAR', 3),
 ('11th Grade Average ACT (2011)', 'VARCHAR', 4),
 ('NET_CHANGE_PLAN_AND_ACT', 'VARCHAR', 3),
 ('COLLEGE_ELIGIBILITY__', 'VARCHAR', 4),
 ('GRADUATION_RATE__', 'VARCHAR', 4),
 ('COLLEGE_ENROLLMENT_RATE__', 'VARCHAR', 4),
 ('COLLEGE_ENROLLMENT', 'SMALLINT', 2),
 ('GENERAL_SERVICES_ROUTE', 'SMALLINT', 2),
 ('FRESHMAN_ON_TRACK_RATE__', 'VARCHAR', 4),
 ('X_COORDINATE', 'DECIMAL', 13),
 ('Y_COORDINATE', 'DECIMAL', 13),
 ('LATITUDE', 'DECIMAL', 18),
 ('LONGITUDE', 'DECIMAL', 18),
 ('COMMUNITY_AREA_NUMBER', 'SMALLINT', 2),
 ('COMMUNITY_AREA_NAME', 'VARCHAR', 22),
 ('WARD', 'SMALLINT', 2),
 ('POLICE_DISTRICT', 'SMALLINT', 2),
 ('LOCATION', 'VARCHAR', 27)]

In [27]:
%%sql
select count(*) as Elementary_school from schools
where "Elementary, Middle, or High School" ='ES'

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(462,)]

In [29]:
%sql select max(safety_score) as MAX_safety from schools

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(99,)]

In [40]:
%%sql 
select school_id, name_of_school, safety_score from schools
where safety_score = (select max(safety_score) from schools)

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(610038, 'Abraham Lincoln Elementary School', 99),
 (609799, 'Alexander Graham Bell Elementary School', 99),
 (610084, 'Annie Keller Elementary Gifted Magnet School', 99),
 (609820, 'Augustus H Burley Elementary School', 99),
 (610132, 'Edgar Allan Poe Elementary Classical School', 99),
 (609901, 'Edgebrook Elementary School', 99),
 (610073, 'Ellen Mitchell Elementary School', 99),
 (610066, 'James E McDade Elementary Classical School', 99),
 (609803, 'James G Blaine Elementary School', 99),
 (610033, 'LaSalle Elementary Language Academy', 99),
 (610355, 'Mary E Courtenay Elementary Language Arts Center', 99),
 (609749, 'Northside College Preparatory High School', 99),
 (609744, 'Northside Learning Center High School', 99),
 (610099, 'Norwood Park Elementary School', 99),
 (610105, 'Oriole Park Elementary School', 99),
 (610155, 'Sauganash Elementary School', 99),
 (609880, 'Stephen Decatur Classical Elementary School', 99),
 (610249, 'Talman Elementary School', 99),
 (610230, 'Wildwood Elementary School', 99)]

In [ ]:
%sql select * from schools

In [43]:
%%sql
select average_student_attendance, name_of_school from schools
order by average_student_attendance desc
limit 10

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(None, 'Velma F Thomas Early Childhood Center'),
 ('98.40%', 'John Charles Haines Elementary School'),
 ('97.80%', 'James Ward Elementary School'),
 ('97.60%', 'Edgar Allan Poe Elementary Classical School'),
 ('97.60%', 'Rachel Carson Elementary School'),
 ('97.60%', 'Orozco Fine Arts & Sciences Elementary School'),
 ('97.50%', 'Annie Keller Elementary Gifted Magnet School'),
 ('97.40%', 'Andrew Jackson Elementary Language Academy'),
 ('97.40%', 'Lenart Elementary Regional Gifted Center'),
 ('97.30%', 'Disney II Magnet School')]

In [44]:
%%sql
select average_student_attendance, name_of_school from schools
order by average_student_attendance
limit 5

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[('57.90%', 'Richard T Crane Technical Preparatory High School'),
 ('60.90%', 'Barbara Vick Early Childhood & Family Center'),
 ('62.50%', 'Dyett High School'),
 ('63.00%', 'Wendell Phillips Academy High School'),
 ('66.30%', 'Orr Academy High School')]

In [53]:
%%sql
select REPLACE(name_of_school,'School','ШКОЛА'), replace(average_student_attendance,'%') from schools
order by average_student_attendance
limit 5

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[('Richard T Crane Technical Preparatory High ШКОЛА', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High ШКОЛА', '62.50'),
 ('Wendell Phillips Academy High ШКОЛА', '63.00'),
 ('Orr Academy High ШКОЛА', '66.30')]

In [61]:
%%sql
select average_student_attendance, name_of_school 
    from schools
    where cast (replace(average_student_attendance,'%','') as double) <'70'
    order by average_student_attendance

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[('57.90%', 'Richard T Crane Technical Preparatory High School'),
 ('60.90%', 'Barbara Vick Early Childhood & Family Center'),
 ('62.50%', 'Dyett High School'),
 ('63.00%', 'Wendell Phillips Academy High School'),
 ('66.30%', 'Orr Academy High School'),
 ('66.80%', 'Manley Career Academy High School'),
 ('68.80%', 'Chicago Vocational Career Academy High School'),
 ('69.60%', 'Roberto Clemente Community Academy High School')]

In [ ]:
%%sql
select sum(COLLEGE_ENROLLMENT) as Enrollment, community_area_name
from schools
group by community_area_name

In [66]:
%%sql
select sum(COLLEGE_ENROLLMENT) as Enrollment, community_area_name
from schools
group by community_area_name
order by Enrollment
limit 5

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(140, 'OAKLAND'),
 (531, 'FULLER PARK'),
 (549, 'BURNSIDE'),
 (786, 'OHARE'),
 (871, 'LOOP')]

In [67]:
%%sql
select safety_score, name_of_school
from schools
where safety_score=(select min(safety_score) from schools)

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(1, 'Edmond Burke Elementary School')]

In [68]:
%%sql
select safety_score, name_of_school
from schools
order by safety_score
limit 5

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(1, 'Edmond Burke Elementary School'),
 (5, "Luke O'Toole Elementary School"),
 (6, 'George W Tilton Elementary School'),
 (11, 'Foster Park Elementary School'),
 (13, 'Emil G Hirsch Metropolitan High School')]

In [81]:
%%sql
select hardship_index, s.community_area_name
from schools SC, chicago_socioeconomic_data S
where s.ca=sc.community_area_number
and sc.COLLEGE_ENROLLMENT= 4368

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(6.0, 'North Center')]

In [88]:
%%sql
select hardship_index, s.community_area_name,sc.COLLEGE_ENROLLMENT
from schools SC, chicago_socioeconomic_data S
where s.ca=sc.community_area_number
and sc.COLLEGE_ENROLLMENT= (select MAX(COLLEGE_ENROLLMENT) from schools)

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(6.0, 'North Center', 4368)]

In [115]:
%%sql
select s.college_enrollment, c.hardship_index, c.community_area_name from chicago_socioeconomic_data C, schools S
where c.ca = s.community_area_number
and s.COLLEGE_ENROLLMENT in (select college_enrollment from schools order by college_enrollment desc limit 1)

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(4368, 6.0, 'North Center')]

In [117]:
%%sql
select Ca, COMMUNITY_AREA_NAME, HARDSHIP_INDEX FROM chicago_socioeconomic_data
   where Ca in 
   (select COMMUNITY_AREA_NUMBER FROM SCHOOLS ORDER BY COLLEGE_ENROLLMENT DESC LIMIT 1 );

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(5.0, 'North Center', 6.0)]

In [94]:
%%sql
select hardship_index, s.community_area_name,sc.COLLEGE_ENROLLMENT
from schools SC, chicago_socioeconomic_data S
where s.ca=sc.community_area_number
and sc.COLLEGE_ENROLLMENT= (select MAX(COLLEGE_ENROLLMENT) from schools)

 * ibm_db_sa://zll40028:***@b0aebb68-94fa-46ec-a1fc-1c999edb6187.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:31249/BLUDB
Done.

[(6.0, 'North Center', 4368)]